#Задача 4.
#number = input("Введите отзыв (off - завершить):")
#while number != "off":
#    print ('Спасибо, ваш отзыв принят!')
#    number = input("Введите отзыв (off - завершить):")
#print ('Система предпочтений настроена')

game = input("Введите game (off - завершить):")
while game != "off":
    if game != "game":
        for i in  range(0, 3):
            if number == 5:
                print("Вы выиграли билет на концерт!")
            else number !=
                print ("Вы не выиграли билет на концерт!")
    number = input("Введите game (off - завершить):")





