# Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
# но только в том случае если они не равны None.

def main():
    F()
def F():
    a = input()
    b = input()
    c = input()
    if a != b != c != 'None':
        print(a, b, c)
main()